Revit 2024 API
FaceDetailNode Methods
The FaceDetailNode type exposes the following members.
Methods
Name | Description
Dispose |  (Inherited from RenderNode.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetInstanceTransform
 Returns instance transform of the object being drawn.
GetLinkTransform
 Returns link transform of the object being drawn.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
FaceDetailNode Class
Autodesk.Revit.DB Namespace